Repository: mbarbon/realtimebattle
Catalog: po/*.po
Languages: es, sv

source: *Starting robots*
es: * Iniciando Robots *
sv: *Startar robotar*

source: *Shutting down robots*
es: * Finalizando Robots *
sv: *Stänger av robotar*

source: *Running*
es: * Ejecutando ... *
sv: *Spelet pågår*

source: *Pausing after game*
es: * Pausar despues del juego *
sv: *Paus efter spelets slut*

source: *Paused*
es: * Pausado *
sv: *Paus*

source: *Exiting*
es: * Saliendo *
sv: *Avslutar*

source: *Finished*
es: * Terminado *
sv: *Spelet slut*

source: No Zoom
sv: Ingen inzoomning

source: Zoom In
es: Aumentar zoom
sv: Zooma in

source: Zoom Out
es: Disminuir zoom
sv: Zooma ut

source: Game
es: Juego
sv: Spel

source: of sequence
sv: i sekvens

source: begins on arena
sv: börjar på arena

source: New Tournament
es: Nuevo CamPeonaTO
sv: Ny turnering

source: Replay Tournament
es: Cargar Campeonato
sv: Repris av turnering

source: Pause
es: Pausa
sv: Paus

source: End
es: FIN
sv: Stoppa

source: Options
es: Opciones
sv: Inställningar

source: Statistics
es: Estadisticas
sv: Statistik

source: Quit
es: QUITAR
sv: Avsluta

source: Show arena window
es: Ver la arena
sv: Visa arenafönster

source: Show message window
es: Ver los mensajes
sv: Visa meddelandefönster

source: Show score window
es: Ver los puntos
sv: Visa resultatfönster

source: Step
es: Paso
sv: Stega

source: End Game
es: Fin Juego
sv: Avsluta spel

source: Kill Marked Robot
es: Matar robots marcados
sv: Döda markerad robot

source: Debug Level:
es: Nivel de Debug:
sv: Debugnivå:

source: Step forward
es: Paso adelante
sv: Stega framåt

source: Step backward
es: Paso atrás
sv: Stega bakåt

source: Next Game
es: Siguiente Partida
sv: Nästa spel

source: Prev Game
es: Partida anterior
sv: Föreg spel

source: Next Seq
es: Siguiente Sequencia
sv: Nästa sekv

source: Prev Seq
es: Secuencia Previa
sv: Föreg sekv

source: Yes
es: Si
sv: Ja

source: No
sv: Nej

source: This action will kill the current tournament.
sv: Detta kommer avbryta pågående turningen.

source: Do you want do that?
sv: Vill du göra det?

source: Choose a log file to replay
es: Selecciona el archivo de log a recrear.
sv: Välj en log-fil att spela upp

source: Clear all messages
es: Borra todos los mensajes
sv: Rensa alla meddelanden

source: Show only marked robot
es: Ver únicamente el robot marcado
sv: Visa endast markerad robot

source: Show all
es: Ver todos
sv: Visa alla

source: Message
es: Mensaje
sv: Meddelande

source: Messages
es: Mensajes
sv: Meddelanden

source: All
es: Todo
sv: Alla

source: Gravitational Constant
es: Constante gravitatoria
sv: Tyngdacceleration

source: Air resistance
es: Resistencia del Aire
sv: Luftmotstånd

source: Roll friction
es: Fricción de giro
sv: Rullfriktion

source: Slide/brake friction
es: Fricción de frenado
sv: Glid/bromsfriktion

source: Robot max acceleration
es: Acelaración máxima
sv: Robots maxacceleration

source: Robot min acceleration
es: Aceleración mínima
sv: Robots minacceleration

source: Robot radius
es: Radio
sv: Robotradie

source: Robot mass
es: Masa
sv: Robotvikt

source: Robot bounce coefficient
es: Coeficiente de salto.
sv: Robots studskoefficient

source: Robot hardness coefficient
es: Coeficiente de dureza
sv: Robots hårdhetskoefficient

source: Robot protection coefficient
es: Coeficiente de protección
sv: Robots skyddskoefficient

source: Robot frontsize [radians]
es: Tamaño [radianes]
sv: Robots frontstorlek [radianer]

source: Robot front bounce coefficient
es: Coeficiente de salto delantero
sv: Robotfronts studskoefficient

source: Robot front hardness coefficient
es: Coeficiente de dureza delantero
sv: Robotfronts hårdhetskoefficient

source: Robot front protection coefficient
es: Coeficiente de protección delantero
sv: Robotfronts skyddskoefficient

source: Robot start energy
es: Energia de inicio
sv: Robots startenergi

source: Robot max energy
es: Energia máxima
sv: Robots maxenergi

source: Robot max rotate speed [rad/s]
es: Velcidad máxima de rotación [rad/s]
sv: Robots högsta rotationshast. [rad/s]

source: Robot cannon max rotate speed [rad/s]
es: Velocidad máxima velocidad de rotación del cañon [rad/s]
sv: Kanons högsta rotationshast. [rad/s]

source: Robot radar max rotate speed [rad/s]
es: Velocidad máxima velocidad de rotación del radar [rad/s]
sv: Radars högsta rotationshast. [rad/s]

source: Process check interval
es: Intérvalo de chequeo del proceso
sv: Tid mellan processkontroller

source: Robot energy levels
es: Niveles de energia
sv: Antal energinivåer för robot

source: Shot radius
es: Radio
sv: Skottradie

source: Shot speed
es: Velocidad
sv: Skotthastighet

source: Shooting penalty (times shot energy)
es: Penalización
sv: Skada på skytt (mult. m skottenergin)

source: Shot min energy
es: Energia mínima
sv: Skotts lägsta energi

source: Shot max energy
es: Energia máxima
sv: Skotts högsta energi

source: Shot energy increase speed [energy/s]
es: Velocidad de aumento de energia energia/s]
sv: Robots skotttenegi-ökning [per sekund]

source: Background colour
es: Color de fondo
sv: Bakgrundsfärg

source: Foreground colour
es: Color de primer plano
sv: Förgrnudsfärg

source: Colour for RTB messages
es: Color para los mensajes
sv: Färg på RTB-meddelanden

source: Cookie max energy
es: Emergia máxima
sv: Kakors högsta energi

source: Cookie min energy
es: Emegia mínima
sv: Kakors lägsta energi

source: Cookie frequency [cookies per second]
es: Frecuencia de cookies [por segundo]
sv: Kakors talrikhet [kakor per sekund]

source: Cookie radius
es: Radio
sv: Kakors radie

source: Cookie colour
es: Color
sv: Kakors färg

source: Mine max energy
es: Energia máxima
sv: Minors högsta energi

source: Mine min energy
es: Energia mínima
sv: Minors lägsta energi

source: Mine frequency [mines per second]
es: Frecuencia de minas [por segundo]
sv: Minors talrikhet [minor per sekund]

source: Mine radius
es: Radio
sv: Minors radie

source: Mine colour
es: Color
sv: Minors färg

source: Arena scale
es: Escala de la Arena
sv: Arenaskala

source: Fast forward factor
es: Velocidad de 'Adelante'
sv: Snabbspolningsfaktor

source: Timeout [s]
sv: Max tids [s]

source: Max timestep
sv: Max tidshopp

source: Timescale
es: Scala de tiempo
sv: Tidsskala

source: Update interval [s]
es: Intervalo de refresco [s]
sv: Uppdateringsintervall [s]

source: Robot startup time [s]
es: Retardo de inicio [s]
sv: Startupptid för robotar [s]

source: Start CPU time [s]
es: Límite de gasto de CPU [s]
sv: Processtid [s]

source: Extra CPU time [s]
es: Tiempo extra de uso de CPU [s]
sv: Extra processtid [s]

source: Extra CPU period [s]
es: Periodo del uso extra de la CPU [s]
sv: Extra processtid-intervall [s]

source: CPU time warning percentage
es: Porcentaje de aviso en el uso de la CPU
sv: Låg processtidsvarning [procent]

source: Robot search path
es: Ruta de busqueda de robots
sv: Robot sökväg

source: Arena search path
es: Ruta de busqueda de arenas
sv: Arena sökväg

source: Directory for temporary files
es: Directorio para archivos temporales
sv: Bibliotek för tillfälliga filer

source: Initial Arena window width
es: Anchura de la ventana de Arenas
sv: Arenafönster bredd

source: Initial Arena window height
es: Altura de la ventana de Arenas
sv: Arenafönster höjd

source: Initial Arena window x position
es: Posición x de la ventana de Arenas
sv: Arenafönster x-position

source: Initial Arena window y position
es: Posición y de la ventana de Arenas
sv: Arenafönster y-position

source: Initial Control window x position
es: Posición x de la ventana de Control
sv: kontrollfönster x-position

source: Initial Control window y position
es: Posición y de la ventana de Control
sv: kontrollfönster y-position

source: Initial Message window width
es: Anchura de la ventana de Mensajes
sv: Meddelandefönster bredd

source: Initial Message window height
es: Altura de la ventana de Mensajes
sv: Meddelandefönster höjd

source: Initial Message window x position
es: Posición x de la ventana de Mensajes
sv: Meddelandefönster x-position

source: Initial Message window y position
es: Posición y de la ventana de Mensajes
sv: Meddelandefönster y-position

source: Initial Score window width
es: Anchura de la ventana de Puntuación
sv: Resultatfönster bredd

source: Initial Score window height
es: Altura de la ventana de Puntuación
sv: Resultatfönster höjd

source: Initial Score window x position
es: Posición de la ventana de Puntuación
sv: Resultatfönster x-position

source: Initial Score window y position
es: Posición de la ventana de Puntuación
sv: Resultatfönster y-position

source: Initial Statistics window width
es: Anchura de la ventana de Estadisticas
sv: Statistikfönster bredd

source: Initial Statistics window height
es: Altura de la ventana de Estadisticas
sv: Statistikfönster höjd

source: Options
es: Opciones
sv: Inställningar

source: Environment
es: Entorno
sv: Omgivning

source: Shot
es: Disparo
sv: Skott

source: Extras
sv: Extra

source: Time
es: Tiempo
sv: Tid

source: Window sizes
es: Tamaño ventanas
sv: Fönster

source: Misc
sv: Övrigt

source: Grab sizes and positions from present windows
es: Guardar tamaños y posiciones de las ventanas actuales
sv: Använd nuvarande fönsterstorlekar och -positioner

source: Load options
es: Cargar opciones
sv: Hämta inställningar

source: Save options
es: Salvar opciones
sv: Spara inställningar

source: Save as default
es: Salvar como predeterminado
sv: Spara som default

source: Apply
es: Aplicar
sv: Verkställ

source: Cancel
es: Cancelar
sv: Ångra

source: Choose an options file to load
es: Nombre del archivo a cargar
sv: Välj installnings-fil att hämta

source: Choose an options file to save
es: Nombre del archivo a guardar
sv: Välj installnings-fil att spara

source: Usage: RealTimeBattle [options]
es: Uso: RealTimeBattle [opciones]
sv: Användning: RealTimeBattle [flaggor]

source: Options:
es: Opciones:
sv: Flaggor:

source: --debug_mode, -d debug mode
es: --debug_mode, -d modo debug
sv: --debug_mode, -d debugläge

source: --debug_level [0-5], -D sets the initial debug level. implies -d
sv: --debug_level [0-5], -D sätt debug-nivå. Implicerar -d

source: --normal_mode, -n normal mode (default)
es: --normal_mode, -n modo normal (predeterminado)
sv: --normal_mode, -n normalt läge (default)

source: --competition_mode, -c competition mode
es: --competition_mode, -c modo competición
sv: --competition_mode, -c tävlingsläge

source: --no_graphics, -g no graphics will be displayed
es: --no_graphics, -g sin gráficos
sv: --no_graphics, -g visa ingen grafik

source: --option_file [file], -o selects option-file (default: $HOME/.rtbrc)
es: --option_file [archivo], -o fichero de opciones (predeterminado: $HOME/.rtbrc)
sv: --option_file [fil], -o välj inställningsfil (default: $HOME/.rtbrc)

source: --log_file [file], -l make log file, if 'file' is '-'
sv: --log_file [fil], -l skapa log-file, om 'fil' är '-'

source: the log is sent to STDOUT
sv: så skickas loggen till STDOUT

source: --tournament_file [file], -t specify a tournament file to
sv: --tournament_file [fil], -t välj turneringsfil för automatisk

source: autostart a tournament
sv: start av turneringen

source: --statistics_file [file], -s file to print the statistics to
sv: --statistics_file [fil], -s skriv statistik till fil vid

source: when autostarting
sv: automatisk turneringsstart

source: --message_file [file], -m redirect messages to 'file'.
sv: --message_file [fil], -m skicka meddelanden till 'fil'

source: '-' as 'file' is equivalent to STDOUT.
sv: Om 'fil' är '-' används STDOUT.

source: If both log and messages are send
sv: Om både loggen och meddelanden skickas

source: to STDOUT, '-m' will be ignored
sv: till STDOUT kommer '-m' att ignoreras

source: --replay [file] -r a log file to replay.
sv: --replay [fil] -r visa spel sparat i 'fil'.

source: if '-' is specified as file,
sv: om filen är '-' kommer

source: input is taken from STDIN
sv: STDIN användas

source: --help, -h prints this message
es: --help, -h muestra este mensaje
sv: --help, -h skriv ut denna hjälptext

source: --version, -v prints the version number
es: --version, -v muestra la verión
sv: --version, -v visa versionsnummer

source: Name
es: Nombre
sv: Namn

source: Energy
sv: Energi

source: Place
sv: Plats

source: Last
sv: Senast

source: Score
sv: Poäng

source: Score
es: Puntos
sv: Poäng

source: Seq:
es: Sec:
sv: Sekv:

source: Statistics
es: Estadisticas
sv: Statistik

source: Close
es: Cerrar
sv: Stäng

source: Save Statistics
es: Guardar Estadisticas
sv: Spara statistik

source: Total
sv: Totalt

source: Sequence Total
es: Total de la Secuencia
sv: Totalt i sekvens

source: Name
sv: Namn

source: Position
es: Posición
sv: Placering

source: Points
es: Puntos
sv: Poäng

source: Games
sv: Spel

source: Survival Time
es: Tiempo de supervivencia
sv: Tid i livet

source: Total Points
es: Puntos Totales
sv: Summa poäng

source: Choose a statistics file to save
es: Archivo para guardar las estadisticas
sv: Välj fil att spara statistik till

source: Seq
sv: Sekv

source: Game
sv: Spel

source: Grand Total
es: Gran TOTAL
sv: Sammanlagd ställning

source: Sequence
es: Secuencia
sv: Sekvens

source: Sequence:
es: Secuencia:
sv: Sekvens:

source: Start New Tournament
sv: Starta ny turnering

source: Robots in Tournament
es: Robots en el Torneo
sv: Robotar i turnering

source: Robots in Directory
es: Robots en el directorio
sv: Robotar i bibliotek

source: Arenas in Tournament
es: Arens en el Torneo
sv: Arenor i bibliotek

source: Arenas in Directory
es: Arenas en el directorio
sv: Arenor i bibliotek

source: Remove
sv: Ta bort

source: Select All
es: Selecciona todo
sv: Välj alla

source: Unselect All
es: Deselecciona todo
sv: Välj ingen

source: Add
es: Añadir
sv: Lägg till

source: Games per sequence
es: Juegos por secuencia
sv: Spel per sekvens

source: Robots per sequence
es: Robots por secuencia
sv: Robotar per sekvens

source: Number of sequences
es: Nº de secuencias
sv: Antal sekvenser

source: All Arenas
es: Todas las Arenas
sv: alla arenor

source: Full Round
es: Ronda entera
sv: Full omgång

source: Load tournament
es: Cargar Torneo
sv: Hämta turnering

source: Save tournament
es: Guardar Torneo
sv: Spara turnering

source: Start
es: Empezar
sv: Börja

source: Choose a tournament file to load
es: Archivo torneo a cargar
sv: Välj turneringsfil att hämta

source: Choose file to save tournament into
es: Archivo torneo a guardar
sv: Välj turneringsfil att spara till

source: Couldn't parse specified tournament file.
sv: Kunde inte tolka innehållet i turneringsfilen.

source: Tournament could not be loaded.
es: El torneo no puedo cargarse
sv: Turneringen kunde inte hämtas.

source: There are too few robots in the tournament.
sv: För få robotar i turneringen.

source: There are no arenas in the tournament.
sv: Ingen arena har valts.

source: Could not open file.
sv: Kunde inte öppna fil.

source: Tournament could not be saved.
es: El torneo no ha podido ser guardado
sv: Turneringen kunde inte sparas.

source: There must be at least two robots in the tournament.
sv: Det måste vara minst två robtar i en turnering.

source: Tournament could not be started.
es: El torneo no se ha podido iniciar.
sv: Turneringen kunde inte startas.

source: Error in
es: Error en
sv: Fel i

source: Brakes locked: Robot found and at distance
sv: Full broms: Robot siktad på anvståndet

source: Brake
es: Freno
sv: Broms

source: Modular angle, Angle
es: Angulo modular, Angulo
sv: Vinkel modulo 2 pi, vinkel

source: New rotation
es: Nueva rotación
sv: Ny rotation

source: New acceleration
es: Nueva acelaración
sv: Ny acceleration

source: Hit too many times! Flee!
sv: Träffad för många gånger! Fly!

source: Cookie eaten!
sv: Kaka uppäten

source: Oh no! A mine
sv: Oh nej! En mina

source: Unknown message:
sv: Okänt meddelande:

source: Process time low:
sv: Processtid låg:

source: Message sent in illegal state:
sv: Meddelande skickat i fel läge:

source: Unknown option:
sv: Okänt alternativ:

source: Obsolete Keyword:
sv: Föråldrat kommando:

source: Shutting down and leaving
sv: Avslutar

source: New
sv: Ny

source: Unknown Object seen!
sv: Okänt objekt siktat!

source: Collided with Unknown Object!
sv: Kolliderade med okänt object!

source: Game %d of sequence %d begins on arena
es: Ha comenzado la partida %d de la secuencia %d.

source: Robot with filename %s has not given any name
es: El Robot con el nombre de fichero %s no ha dado nombre.

source: Game %d of sequence %d
es: Partida %d de la secuencia %d.

source: This action will kill the current tournament. Do you want to do that?
es: Con esto abortaras el campeonato actual. ¿Estás seguro?

source: Logging frequency [Each n:th update interval]
es: Frecuencia de 'logeo' [refresca cada n-veces]

source: Max robots allowed simultaneously
es: Número máximo de robot simultaneos

source: Max
es: Máx

source: Default
es: Predeterminado

source: --debug_level [0-5], -D sets the initial debug level. Implies -d
es: --debug_level [0-5], -D Nivel de debug inicial. necesario -d

source: --log_file [file], -l make log file, if 'file' is '-' the log is sent to STDOUT
es: --log_file [archivo], -l archivo de log, si es '-' el log se envia a STDOUT

source: --tournament_file [file], -t specify a tournament file to autostart a tournament
es: --tournament_file [archivo], -t archivo de torneo que se iniciará automáticamente

source: --statistics_file [file], -s file to print the statistics to when autostarting
es: --statistics_file [archivo], -s archivo donde se volcarán las estadisticas

source: --message_file [file], -m redirect messages to 'file'. With '-' as 'file', STDOUT is used. If both log and messages are sent to STDOUT, '-m' will be ignored
es: --message_file [archivo], -m envia los mensajes al 'archivo'. Con '-' como 'archivo', se usará STDOUT. Si se envián tanto el log como los mensajes a STDOUT, '-m' no se tendrá en cuenta.

source: --replay [file] -r a log file to replay. if '-' is specified as file, input is taken from STDIN
es: --replay [archivo] -r archivo log a recrear. si se indica '-' como archivo, la entrada se coge de STDIN

source: Energy
es: Energia

source: Place
es: Lugar

source: Last
es: Último

source: Games
es: Juegos

source: Seq
es: Sec

source: Error in specified tournament file.
es: Error en el archivo especificado

source: There are too few robots in the tournament.
es: No hay suficientes robots en el torneo

source: There are no arenas in the tournament.
es: No hay arenas en el torneo

source: Could not open file.
es: No se puede abrir el archivo

source: There must be at least two robots in the tournament.
es: Deben existir al menos dos robots en el torneo.

source: Acceleration
es: Acelaración
